data/ninjafoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    north_face
    {
        type            fixedValue;
        value           uniform 1;
    }

    west_face
    {
        type            zeroGradient;
    }

    east_face
    {
        type            zeroGradient;
    }

    south_face
    {
        type            zeroGradient;
    }

    minZ
    {
        type            zeroGradient;
    }

    maxZ
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
